leetcode_2477_minimum_fuel_cost_to_report_to_the_capital.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2477. Minimum Fuel Cost to Report to the Capital</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2477. Minimum Fuel Cost to Report to the Capital</h1>
<p>
<a href="https://leetcode.com/problems/minimum-fuel-cost-to-report-to-the-capital/">Problem Statement</a>
</p>

<div id="outline-container-orgea5d9f5" class="outline-2">
<h2 id="orgea5d9f5">Patterns</h2>
<div class="outline-text-2" id="text-orgea5d9f5">
<ul class="org-ul">
<li><a href="pattern_tree_problem.html#ID-63791EB8-1E2A-41D3-AFCE-1511EFAE55AC">Pattern: Tree Problem</a>.</li>

<li><a href="pattern_optimization_problem_to_find_minimum_maximum_number_of_x_to_cover_y.html#ID-45D8FD21-992F-4073-8EC6-7695FAA0E3AB">Pattern: Optimization problem to find minimum/maximum number of X to cover Y</a>.</li>

<li><a href="pattern_problem_allows_making_optimal_local_decisions.html#ID-63F5032C-75D7-4D9E-A558-914218193D0B">Pattern: Problem allows making optimal local decisions</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org87113de" class="outline-2">
<h2 id="org87113de">Prompts</h2>
<div class="outline-text-2" id="text-org87113de">
<ul class="org-ul">
<li><a href="can_we_solve_the_problem_using_a_greedy_approach.html#ID-1CA3366B-D045-4BF4-9E39-DFA5131EF937">Can we solve the problem using a greedy approach?</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdd86357" class="outline-2">
<h2 id="orgdd86357">Solution</h2>
<div class="outline-text-2" id="text-orgdd86357">
<p>
Let's start with a definition for leaf and parent cities.  A leaf city is a city with only one connection to an other city which we call parent city.  By this definition, the representative in a leaf city has only one option to go to the capital which is driving first to their parent cities.
</p>

<p>
The solution consists on executing the following reduction to the input tree.  We move representatives from leaf cities to their parent cities.  Then, we remove the leaf cities from the tree what creates new leaf cities since some parent cities will have only one connection remaining.  If there is only one city left, it must be the capital and the problem is solved.  Otherwise, we execute the same process again.  While we move the representatives, we keep track of the accumulated cost so far and the number of representatives waiting to drive to the capital.  Since we can take an local optimal decision to move representatives from leaf to parent cities, this is a <a href="greedy_algorithm.html#ID-FFC75108-C74E-44B1-9B60-B3A22B15E617">Greedy algorithm</a>.  And you can implement it using a <a href="depth_first_search.html#ID-212DBFC3-FE3C-493E-86A6-42FF3F82CD53">Depth-first search</a> with time and space complexity of \(O(n)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minimumFuelCost</span>(<span style="font-weight: bold;">self</span>, roads: List[List[<span style="font-weight: bold;">int</span>]], seats: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(roads) + 1
        <span style="font-weight: bold; font-style: italic;">A</span> = [[] <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N)]
        <span style="font-weight: bold;">for</span> u, v <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">roads</span>:
            A[u].append(v)
            A[v].append(u)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(u, p):
            <span style="font-weight: bold; font-style: italic;">total</span>, <span style="font-weight: bold; font-style: italic;">count</span> = 0, 1
            <span style="font-weight: bold;">for</span> v <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">A</span>[u]:
                <span style="font-weight: bold;">if</span> v != <span style="font-weight: bold; font-style: italic;">p</span>:
                    <span style="font-weight: bold; font-style: italic;">ecost</span>, <span style="font-weight: bold; font-style: italic;">ecount</span> = dfs(v, u)
                    <span style="font-weight: bold; font-style: italic;">total</span> += ecost
                    <span style="font-weight: bold; font-style: italic;">count</span> += ecount
            <span style="font-weight: bold;">if</span> u == 0:
                <span style="font-weight: bold;">return</span> total
            <span style="font-weight: bold;">return</span> total + ceil(count / seats), count

        <span style="font-weight: bold;">return</span> dfs(0, <span style="font-weight: bold; text-decoration: underline;">None</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-org30a6472" class="outline-2">
<h2 id="org30a6472">Cited by 1</h2>
<div class="outline-text-2" id="text-org30a6472">
<ul class="org-ul">
<li><a href="interview_preparation_v.html#ID-8C7E9E52-9220-4A7B-B0E6-54F960E17CA8">Interview preparation: V</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>